app/Controllers/Blog.php

    public function new(): string
    {
        $data = [
            'meta_title' => 'New Post',
            'title' => 'Create new post',
        ];

        if ($_SERVER['REQUEST_METHOD'] == 'POST') {
            $model = new BlogModel();
            $model->save($_POST);
---
INSERT INTO `posts` (`post_title`, `post_content`) VALUES ('test', 'this is a test')

    public function edit(int $id): string
    {
        $model = new BlogModel();
        $post = $model->find($id);

        $data = [
            'meta_title' => $post['post_title'],
            'title' => $post['post_title'],
        ];

        if ($_SERVER['REQUEST_METHOD'] == 'POST') {
            $model = new BlogModel();
            $_POST['post_id'] = $id;
            $model->save($_POST);
---
INSERT INTO `posts` (`post_title`, `post_content`) VALUES ('test', 'this is a test after editing')