app/Models/CustomModel.php

SELECT *
FROM `posts`
JOIN `users` ON `posts`.`post_author` = `users`.`user_id`
---
    public function getPosts(): array
    {
        $builder = $this->db->table('posts');
        $builder->join('users', 'posts.post_author = users.user_id');
        $posts = $builder->get()->getResult();